brew 'bash'
brew 'coreutils' # those that come with macos are usually outdated
brew 'gh'
brew 'git'
brew 'koekeishiya/formulae/skhd'
brew 'koekeishiya/formulae/yabai'
brew 'neovim'
brew 'node'
brew 'pyenv'
brew 'stow'

cask 'alacritty'
cask 'discord'
cask 'docker'
cask 'github'
cask 'notion'
cask 'visual-studio-code'
cask 'zoom'
cask 'spotify'
cask 'linear-linear'

tap 'homebrew/cask-fonts'
cask 'font-blex-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-iosevka-nerd-font'
