# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'heroku/brew'
tap 'koekeishiya/formulae'

# Shells
brew 'zsh'

# GNU utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-indent'
brew 'gnu-which'

# Node
brew 'node'
brew 'nvm'

# Python
brew 'python'
brew 'pyenv'

# MacOS tools
brew 'dark-mode'
brew 'mas'

# Window Manager
brew 'yabai'
brew 'skhd'

# LaTeX
cask 'mactex-no-gui'
cask 'skim'

# Development
cask 'visual-studio-code'
cask 'jetbrains-toolbox'

# Communication/Social
cask 'discord'
cask 'slack'
cask 'zoomus'

# Media
brew 'ncspot'
brew 'pianobar'
cask 'spotify'

# Games
cask 'minecraft'

# Other binaries
brew 'git'
brew 'grep'
brew 'heroku'
brew 'stow'     # GNU symlink manager
brew 'trash'    # Manage the Trash bin
brew 'tree'     # List directories in a tree structure
brew 'tor'
brew 'vim'              
brew 'wget'     # curl without 16 flags for a single download

# Other Mac apps
cask 'alacritty'
cask 'notion'
cask 'meetingbar'

# Mac App Store
mas 'Spark', id: 1176895641
mas 'Xcode', id: 497799835
mas 'Meeter', id: 1510445899

# Fonts
cask 'font-iosevka'